Autodesk.Revit.DB.Events.DocumentPrintingEventArgs.GetSettings
Gets the print settings of the active printing session.
Returns:
The print settings of the active printing session.
Since:
2010

Autodesk.Revit.DB.Events.DocumentPrintingEventArgs.GetViewElementIds
Returns ElementIds of the views to be printed.
Returns:
ElementIds of the views to be printed.
Since:
2010

Autodesk.Revit.DB.Events.DocumentPrintingEventArgs
The event arguments used by the DocumentPrinting event.
Since:
2010